In [1]:
import numpy as np
import pandas as pd

In [2]:
ls

LAB2 19102021.ipynb  file2.xlsx
file1.xlsx           file3.xlsx

In [4]:
!conda install openpyxl

Collecting package metadata (current_repodata.json): done
Solving environment: done

# All requested packages already installed.

# Show the DataFrame's shape.

In [5]:
file1=pd.read_excel('file1.xlsx',engine='openpyxl')

In [6]:
file1.shape

(1071, 11)

In [7]:
file2=pd.read_excel('file2.xlsx',engine='openpyxl')

In [8]:
file2.shape

(996, 11)

In [11]:
file3=pd.read_excel('file3.xlsx',engine='openpyxl')

In [12]:
file3.shape

(7070, 11)

# Rename columns in file3

In [74]:
file3.rename(columns={'State': 'ST'}, inplace=True)

In [75]:
file3.rename(columns={'Gender': 'GENDER'}, inplace=True)

# Concatenate the three dataframes

In [76]:
files=pd.concat([file1,file2,file3],axis=0)

In [77]:
files

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0,94,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767,108,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0,106,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357,68,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,Bachelor,23405.98798,71941,73,0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,College,3096.511217,21604,79,0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,Bachelor,8163.890428,0,85,3,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,College,7524.442436,21941,96,0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,College,2611.836866,0,77,0,Corporate Auto,Two-Door Car,369.600000

In [78]:
files.shape

(9137, 11)

# Standardize header names.

In [79]:
cols=[]
for i in range(len(files.columns)):
    cols.append(files.columns[i].lower())

In [80]:
files.columns=cols

In [81]:
files.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0,1000,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0,94,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767,108,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0,106,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357,68,1/0/00,Personal Auto,Four-Door Car,17.269323

# Rearrange the columns in the dataframe as needed

In [82]:
files=files.drop_duplicates()

In [83]:
files.shape

(9134, 11)

# Which columns are numerical?

In [84]:
files.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value       object
income                         int64
monthly premium auto           int64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

### income, monthly premium auto and total claim amount is a float

# Which columns are categorical?

In [85]:
files.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value       object
income                         int64
monthly premium auto           int64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

### all of it instead the ones present it in the last exercise

# Delete the column education and the number of open complaints from the dataframe.

In [86]:
filesnew=files.drop(['education','number of open complaints'],axis=1)

In [87]:
filesnew.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,697953.59%,0,94,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,1288743.17%,48767,108,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,764586.18%,0,106,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,536307.65%,36357,68,Personal Auto,Four-Door Car,17.269323

# Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [88]:
filesnew.shape

(9134, 9)

In [98]:
filesnew['customer lifetime value'] = filesnew['customer lifetime value'].str.rstrip('%').astype('float') * 100

In [99]:
filesnew.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,69795359.0,0,94,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,128874317.0,48767,108,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,76458618.0,0,106,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,53630765.0,36357,68,Personal Auto,Four-Door Car,17.269323

# Check for duplicate rows in the data and remove if any.

In [89]:
filesnew=filesnew.drop_duplicates()

In [90]:
filesnew.shape

(9134, 9)

In [100]:
filesnew.info

<bound method DataFrame.info of      customer          st gender  customer lifetime value  income  \
0     RB50392  Washington    NaN                      NaN       0
1     QZ44356     Arizona      F               69795359.0       0
2     AI49188      Nevada      F              128874317.0   48767
3     WW63253  California      M               76458618.0       0
4     GA49547  Washington      M               53630765.0   36357
...       ...         ...    ...                      ...     ...
7065  LA72316  California      M                      NaN   71941
7066  PK87824  California      F                      NaN   21604
7067  TD14365  California      M                      NaN       0
7068  UP19263  California      M                      NaN   21941
7069  Y167826  California      M                      NaN       0

      monthly premium auto     policy type  vehicle class  total claim amount
0                     1000   Personal Auto  Four-Door Car            2.704934
1                       94   Personal Auto  Four-Door Car         1131.464935
2                      108   Personal Auto   Two-Door Car          566.472247
3                      106  Corporate Auto            SUV          529.881344
4                       68   Personal Auto  Four-Door Car           17.269323
...                    ...             ...            ...                 ...
7065                    73   Personal Auto  Four-Door Car          198.234764
7066                    79  Corporate Auto  Four-Door Car          379.200000
7067                    85  Corporate Auto  Four-Door Car          790.784983
7068                    96   Personal Auto  Four-Door Car          691.200000
7069                    77  Corporate Auto   Two-Door Car          369.600000

[9134 rows x 9 columns]>

# Filter out the data for customers who have an income of 0 or less.

In [105]:
filesnew=filesnew.query('income<=0')

In [106]:
filesnew

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,NaN,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,69795359.0,0,94,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,76458618.0,0,106,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,72161003.0,0,101,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,47389920.0,0,67,Personal Auto,Four-Door Car,482.400000
...,...,...,...,...,...,...,...,...,...
7059,WZ45103,California,F,NaN,0,76,Personal Auto,Four-Door Car,364.800000
7061,RX91025,California,M,NaN,0,185,Personal Auto,SUV,1950.725547
7062,AC13887,California,M,NaN,0,67,Corporate Auto,Two-Door Car,482.400000
7067,TD14365,California,M,NaN,0,85,Corporate Auto,Four-Door Car,790.784983
7069,Y167826,California,M,NaN,0,77,Corporate Auto,Two-Door Car,369.600000